{
  "recipes": [
    {
      "id": 1,
      "name": "Beef Bobotie",
      "ingredients": [
        "2 tablespoons butter",
        "2 medium onions, finely chopped",
        "3 cloves garlic",
        "1 teaspoon grated ginger",
        "1 teaspoon curry powder",
        "3 cloves",
        "2 tablespoons chutney, such as Mrs. Ball's Chutney, plus more for topping",
        "600 grams minced beef",
        "1 tablespoon vinegar",
        "1 tablespoon Worcestershire sauce",
        "1 beef stock cube",
        "2 slices white bread, crusts removed, soaked in milk",
        "1 large egg",
        "1/2 cup milk",
        "1 teaspoon turmeric",
        "2 tablespoons double cream, optional",
        "Salt, to taste",
        "Freshly ground black pepper, to taste",
        "Handful bay leaves"
      ],
      "instructions": "1. Preheat oven to 180°C. 2. Melt butter and sauté onions, garlic, and ginger. 3. Add curry powder and cloves. 4. Stir in chutney, minced beef, vinegar, Worcestershire sauce, and stock cube. 5. Add soaked bread, egg, milk, and turmeric. 6. Transfer to a baking dish, add bay leaves, and bake for 40-45 minutes."
    },
    {
      "id": 2,
      "name": "Madombi (Dumplings)",
      "ingredients": [
        "3 cups (425 grams) all-purpose flour, plus more for kneading",
        "2 tablespoons baking powder",
        "1 1/2 teaspoons salt",
        "2 teaspoons instant dry yeast",
        "2 teaspoons sugar",
        "300 milliliters (10 ounces) warm water"
      ],
      "instructions": "1. Mix flour, baking powder, salt, yeast, and sugar. 2. Add warm water and knead until smooth. 3. Let dough rise for 1 hour. 4. Divide into balls, place in a steamer, and steam for 20-25 minutes."
    },
    {
      "id": 3,
      "name": "Chicken Curry",
      "ingredients": [
        "2 tablespoons ghee, or unsalted butter",
        "2 tablespoon vegetable oil",
        "1 tablespoon curry powder, or garam masala",
        "1 tablespoon ground coriander",
        "1 tablespoon ground cumin",
        "1 teaspoon whole cumin",
        "1 teaspoon cayenne pepper, or to taste",
        "2 whole cinnamon sticks, about 1/2 ounce",
        "1 medium onion, finely chopped",
        "1 tablespoon grated fresh ginger",
        "4 cloves garlic, minced",
        "3 pounds bone-in, skin-on chicken pieces, preferably thighs, drumsticks, and wings",
        "2 medium tomatoes, chopped",
        "1 tablespoon tomato paste",
        "2 medium potatoes, peeled and cut into 1/2-inch pieces",
        "1 medium rutabaga, peeled and cut into 1/2-inch pieces",
        "1 cup chicken stock",
        "1 sprig curry leaves",
        "Kosher salt, to taste",
        "Fresh coriander leaves, for garnish, optional",
        "Cooked basmati rice, for serving, optional"
      ],
      "instructions": "1. Heat ghee and oil in a large pot. 2. Add curry powder, coriander, cumin, and cayenne. 3. Stir in onions, ginger, and garlic. 4. Add chicken pieces and brown. 5. Stir in tomatoes and tomato paste. 6. Add potatoes, rutabaga, chicken stock, and curry leaves. 7. Simmer until chicken is cooked and vegetables are tender."
    },
    {
      "id": 4,
      "name": "Shank and Shin Potjie",
      "ingredients": [
        "1 kg meaty beef shin, cut through the bone into 2 cm thick slices",
        "750 g lamb shank, cut into 6 cm pieces",
        "4 T (60 ml) flour",
        "1 T (15 ml) Ina Paarman’s Beef Flavour Stock Powder",
        "2 t (10 ml) Ina Paarman’s Garlic Pepper Seasoning",
        "2 t (10 ml) Ina Paarman’s Garlic & Herb Seasoning",
        "2 T (30 ml) olive or canola oil",
        "2 large onions, chopped",
        "2 cups (500 ml) water",
        "2 T (30 ml) fat skimmed from meat or oil",
        "1 T (15 ml) butter",
        "1 kg small pickling onions or shallots, cut in half",
        "2 t (10 ml) brown sugar",
        "1 t (5 ml) Ina Paarman’s Green Onion Seasoning",
        "1 x 200 ml Ina Paarman’s Sun-dried Tomato Coat & Cook Sauce",
        "½ cup (125 ml) water",
        "2 bay leaves",
        "¼ cup (60 ml) chopped parsley",
        "grated rind from 1 lemon",
        "2 garlic cloves, finely chopped"
      ],
      "instructions": "Phase 1: 1. Coat beef and lamb with flour and seasonings. 2. Heat oil and brown meat. 3. Add onions and water. 4. Simmer for 1-2 hours. Phase 2: 1. Remove fat, add butter and onions. 2. Stir in sugar, seasonings, sauce, and water. 3. Add bay leaves and cook until onions are tender. 4. Top with gremolata."
    },
    {
      "id": 5,
      "name": "Everyday Chicken Curry",
      "ingredients": [
        "2 tbsp (30ml) cooking oil",
        "1 kg chicken pieces",
        "1 large onion, finely chopped",
        "4 cloves garlic, minced",
        "2 tsp (10ml) minced ginger",
        "2 tbsp (30ml) Rajah medium curry powder",
        "1 tbsp (15ml) ground coriander",
        "1 tbsp (15ml) ground cumin",
        "1 tsp (5ml) paprika",
        "1 tsp (5ml) ground cinnamon",
        "salt and pepper, to taste",
        "½ - 1 cup (250ml) tomato puree",
        "1 cup (250ml) chicken stock",
        "400 ml coconut milk (optional)",
        "1 tbsp cornflour mixed with 2 tbsp cold water to make a slurry (optional)"
      ],
      "instructions": "1. Heat oil in a large frying pan/pot over medium-high heat. 2. Add the chicken and cook for 5 minutes, turning occasionally, until sealed. 3. Add the onion to the pan and cook for 5 minutes, stirring often, to soften. 4. Add garlic, ginger, curry powder, ground coriander, cumin, paprika, cinnamon, salt, and pepper. Stir and cook for a further minute. 5. Add tomato puree, stock, and coconut milk. 6. Bring to a gentle bubble, then simmer gently, stirring occasionally for 10 minutes – until the chicken is cooked through. 7. If you would like to thicken the curry, stir in the cornflour slurry. Serve with basmati rice or your preferred starch."
    },
    {
      "id": 6,
      "name": "Chicken and Pea Curry",
      "ingredients": [
        "2 tbsp (30ml) cooking oil",
        "2 garlic cloves, minced",
        "2 tsp (10ml) ginger, grated",
        "1 onion, finely chopped",
        "500 g chicken thigh, sliced",
        "2 tbsp (30ml) Rajah flavourful mild curry powder",
        "270 ml coconut milk",
        "375 ml chicken stock",
        "½ tsp (2,5ml) salt",
        "1 cup frozen peas",
        "¼ cup (62,5ml) fresh coriander"
      ],
      "instructions": "1. Heat oil in a large pan over medium high heat. 2. Cook garlic, ginger, and onion for 2 minutes until onion is translucent. 3. Add chicken and cook until it changes colour from pink to white. 4. Add Rajah curry powder and cook for 2 minutes. 5. Add coconut milk and chicken stock. Stir, lower heat to medium and cook, simmering rapidly, for 15 minutes until sauce reduces and thickens. 6. Add peas and salt. Cook for a further minute, then taste to see if it needs more salt. Garnish with coriander. Serve over rice or mashed potato!"
    },
    {
      "id": 7,
      "name": "Speedy Chicken Curry with Flatbreads and Cucumber Raita",
      "ingredients": [
        "Flatbreads",
        "300 g self-raising flour",
        "15 ml (1 tbsp) olive oil",
        "1 x 400 ml tin coconut milk",
        "extra flour for dusting",
        "butter or coconut oil, for frying",
        "Cucumber raita",
        "125 ml (½ cup) full cream plain yoghurt",
        "1 salad onion, finely sliced",
        "6 cm piece of cucumber, coarsely grated",
        "small bunch coriander (5g), roughly chopped",
        "Chicken curry",
        "10 ml (2 tsp) olive oil",
        "4 x chicken thighs and 4 drumsticks",
        "salt and pepper",
        "1 brown onion (about 120 g), finely chopped",
        "10 ml (2 tsp) Rajah mild & spicy curry powder",
        "5 ml (1 tsp) crushed ginger",
        "1 x 400 g tin diced tomatoes",
        "250 ml (1 cup) chicken stock",
        "40 g baby spinach",
        "coriander, for serving (optional)"
      ],
      "instructions": "1. To prepare the flatbread dough, place the self-raising flour in a mixing bowl. Add the olive oil and 225 ml of coconut milk. (Reserve the leftover coconut milk for the curry.) Mix to form a dough. Cover the bowl and set aside. 2. To prepare the raita, place the yoghurt and onion in a small bowl. Squeeze the excess liquid out of the cucumber and add to the bowl with the coriander. Mix well and set aside in the fridge. 3. To prepare the curry, heat the oil in a deep saucepan. Season the chicken with salt and pepper and fry in the oil for 3 minutes per side until golden and crispy. Remove from the pan and set aside. 4. Add the onion to the same pan and sauté for 2-3 minutes. Add the Rajah curry powder and ginger and cook for a further minute. Stir the tomatoes, chicken stock, and remaining 175 ml coconut milk into the pot. Add the chicken back in, bring to the boil then lower the heat and simmer for 20-25 minutes, stirring occasionally, until the chicken is cooked through. 5. While the chicken is simmering, cook the flatbreads. Dust the work surface with flour and divide the dough into eight balls. Use a rolling pin to roll each ball into a rough 12cm circle. Heat half a teaspoon of butter or coconut oil in a frying pan. Cook the flatbreads in batches for 3-4 minutes per side until golden and puffed up, adding more butter as needed. Wrap the cooked breads in a clean tea towel and set aside. 6. Check the seasoning of the curry. Add the spinach to the pot and stir through until wilted. Dish the curry onto plates and top with coriander if using. Serve with the warm flatbreads and cucumber raita."
    },
    {
      "id": 8,
      "name": "Chicken Karai",
      "ingredients": [
        "Marinade",
        "5 ml (1 teaspoon) Rajah All-In-One Curry Powder",
        "10 ml (2 teaspoonns) Rajah Hot Curry Powder",
        "5 ml (1 teaspoon) dhana powder",
        "2.5 ml (½ teaspoon) freshly cracked black pepper",
        "5 ml (1 teaspoon) salt",
        "Curry",
        "1 whole chicken cut into pieces",
        "30 ml (2 tablespoons) tomato paste",
        "125 ml (½ cup) fried onions",
        "125 ml (½ cup) plain yoghurt",
        "60 ml (4 tablespoons) ghee",
        "5 ml (1 teaspoon) jeera seeds",
        "1 chilli slit",
        "4 tomatoes chopped",
        "2.5 ml (½ teaspoon) sugar",
        "6 ml (1 heaped teaspoon) freshly made ginger",
        "5 ml (1 teaspoon) crushed garlic",
        "2.5 ml (½) bunch dhanya",
        "sliced ginger for garnish"
      ],
      "instructions": "1. Marinate your chicken in all your spices, 2.5ml (1/2) of the dhania powder, tomato paste, onions, and yogurt. Allow to marinate for a few hours. 2. Place a flat pot on medium high heat, add in your ghee, once your ghee is melted add in your jeera seeds and chilli, cook for a few seconds before adding your marinated chicken. Allow to cook for 10 minutes before adding in your tomatoes and sugar. 3. Add in your tomatoes and sugar, place heat on low and allow chicken to cook for 20 minutes with lid on mixing halfway through. 4. Garnish with remaining fresh dhania and ginger. Serve immediately with roti and crispy potato wedges."
    }
  ]
}
